[
    {
      "name": "LITERMI",
      "position": "Desarrollador de back-end",
      "startDate": "2024-04-30",
      "endDate": "",
      "highlights": [],
      "url": "https://www.linkedin.com/company/litermicreatingchange/",
      "location": "La Paz, Bolivia"
    },
    {
      "name": "Altacrest LLP",
      "position": "Desarrollador y devop",
      "startDate": "2023-12-31",
      "endDate": "2024-03-31",
      "highlights": [],
      "summary": "Desarrollé módulos de logística de envíos utilizando Angular y Go, optimizando procesos de entrega. Implementé soluciones de DevOps con GitLab para automatizar despliegues continuos (CI/CD) en Kubernetes, asegurando alta disponibilidad y escalabilidad.",
      "url": "https://www.linkedin.com/company/altacrest-jobs/"
    },
    {
      "name": "LITERMI",
      "position": "Fullstack Developer",
      "startDate": "2022-08-31",
      "endDate": "2023-03-31",
      "highlights": [],
      "summary": "- Implementé una nueva solución en la aplicación principal de Telemarketing con PHP y JavaScript, lo que permitió aumentar las capacidades de ventas de lotería en un 5%.\n\n- Optimicé la principal pasarela de pagos, llegando a aumentar la capacidad de procesamiento de pagos y, por ende, aumentar las ganancias.\n\n- Realicé la creación de Pruebas de Concepto (POC) para reemplazar crones de PHP por crones en AWS Lambda con Serverless Framework y SAM de Amazon integrados con Spring Framework para que se puedan hacer tanto APIs como crones sin necesidad de implementar más frameworks.\n\n- Desarrollé un feature para aumentar la capacidad de cobro a través de fees utilizando Microservicios, con PHP, Nodejs y Typescript.",
      "url": "https://www.linkedin.com/company/litermicreatingchange/",
      "location": "Uruguay"
    },
    {
      "name": "Ministerio de Economía y Finanzas Públicas",
      "position": "Jefe de la Unidad de Infraestructura ",
      "startDate": "2021-04-30",
      "endDate": "2022-08-31",
      "highlights": [],
      "summary": "Rol de liderazgo a cargo de un equipo de 10 personas enfocadas en el desarrollo y mantenimiento del sistema.\n \n- Desarrollo de un sistema de monitoreo multiplataforma y multiprotocolo mediante bots de plataformas de chat, que vigila las 24 horas del día todos los servidores, equipos, nodos, bases de datos y aplicaciones, usando Java 17 y Jenkins para su ejecución. \n\n- Creé un framework para que los desarrolladores puedan crear más alertas en el protocolo, sistema o API que deseen, para que el sistema de monitoreo sea escalable de acuerdo a las características personalizadas de la institución. \n\n- Participé en la implementación de un sistema de Seguridad de la Información en el Área para mejorar la seguridad de los Sistemas, servidores y activos de la institución.",
      "url": "https://www.linkedin.com/company/ministerio-de-econom-a-y-finanzas-p-blicas/",
      "location": "La Paz, La Paz, Bolivia"
    },
    {
      "name": "Ministerio de Economía y Finanzas Públicas",
      "position": "Responsable de Arquitectura de Soluciones Web",
      "startDate": "2014-03-31",
      "endDate": "2021-05-31",
      "highlights": [],
      "summary": "Desarrollo desde cero del Sistema de Gestión Pública (SIGEP), el más grande de gestión financiera en el sector privado en Bolivia. Colaboración en otros sistemas como en el SICOES y SIGMA, sistemas de contrataciones estatales y financieros:\n\n- Desarrollo y mantenimiento de multitud de módulos parte del centro de este sistema SIGEP.\n\n- Realicé el desarrollo de la infraestructura de proyecto de código basados en Java, JSF, ADF, EJB, Angular en Typescript y Javascript. Además, realicé pruebas de tipo(PoC) para escoger frameworks y lenguajes para la creación del Sistema.\n\n- Optimización del trabajo de los desarrolladores a través del desarrollo de librerías para que puedan seguir una línea de código estándar utilizando Java. \n\n- Participé en la resolución de problemas de código de los desarrolladores como miembro del grupo responsable de la arquitectura del código, así como también scrum master de grupo.",
      "url": "https://www.linkedin.com/company/ministerio-de-econom-a-y-finanzas-p-blicas/"
    },
    {
      "name": "Ministerio de Economía y Finanzas Públicas",
      "position": "Profesional Desarrollador",
      "startDate": "2009-09-30",
      "endDate": "2021-04-30",
      "highlights": [],
      "summary": "Desarrollo de los modulos de Recursos, contabilidad y aportaciones al CORE del sistema",
      "url": "https://www.linkedin.com/company/ministerio-de-econom-a-y-finanzas-p-blicas/"
    },
    {
      "name": "Food for the Hungry, Inc.",
      "position": "Desarrollador Outsourcing",
      "startDate": "2006-03-31",
      "endDate": "2008-08-31",
      "highlights": [],
      "summary": "Desarrollo de su sistema de RRHH, Vacaciones, Evaluación, y Planillas",
      "url": "https://www.linkedin.com/company/food-for-the-hungry-inc/",
      "location": "La Paz"
    }
  ]