[
    {
        "description": "Librería para seguridad de servicios web compartidos en diferentes tipos de usuarios. Permite proteger endpoints y recursos usando JWT y está diseñada para integrarse fácilmente en proyectos Java con Maven. Disponible en Sonatype Central.",
        "url": "https://github.com/Programmercito/datasealguard-java",
        "name": "DataSealGuard",
        "tech": [
            "Java",
            "Maven",
            "Jwt"
        ],
        "despliegue": "https://central.sonatype.com/artifact/io.github.programmercito/DataSealGuard"
    },
    {
        "description": "Librería Java para generar enlaces con parámetros firmados mediante JWT usando criptografía asimétrica. Permite que un backend independiente firme el contenido de un parámetro, el cual se envía como parte de un link. En la web, sin necesidad de backend, el frontend valida el JWT con la clave pública y, solo si la firma es válida, muestra el contenido. Así, se garantiza la integridad y autenticidad de los datos en páginas estáticas, evitando manipulaciones y eliminando la necesidad de un backend para la verificación.",
        "url": "https://github.com/Programmercito/JwtLinkDinamic",
        "name": "JwtLinkDinamic",
        "tech": [
            "Java",
            "Maven",
            "Jwt",
            "Angular"
        ],
        "despliegue": "https://central.sonatype.com/artifact/io.github.programmercito/JwtLinkDinamic"
    },
    {
        "description": "Librería para usar Google Adsense en Angular16+. Permite integrar anuncios de Google Adsense de forma sencilla y eficiente en aplicaciones desarrolladas con Angular, utilizando TypeScript. Publicada en NPM.",
        "url": "https://github.com/Programmercito/osbo-adsense-angular",
        "name": "OsboAdsenseAngular",
        "tech": [
            "Angular",
            "Typescript",
            "GoogleAdsense"
        ],
        "despliegue": "https://www.npmjs.com/package/osbo-adsense-angular"
    },
    {
        "description": "Bot para Telegram que permite hacer chats entre usuarios. Desarrollado con Java, SpringBoot y ActiveMQ, utiliza la API de Telegram y una base de datos Sql lite para gestionar las conversaciones. El bot está disponible en Telegram.",
        "url": "https://github.com/Programmercito/date-bots",
        "name": "DateBots",
        "tech": [
            "Java",
            "SpringBoot",
            "ActiveMQ",
            "Telegram Api",
            "Sql lite"
        ],
        "despliegue": "https://t.me/amistadbo"
    },
    {
        "description": "Bot de Telegram que lee los horarios de cines para verlos en un canal de Telegram. Utiliza Playwright y TypeScript para hacer scraping de los horarios y publicarlos automáticamente en el canal.",
        "url": "https://github.com/Programmercito/scraping-cines",
        "name": "ScrapingCines",
        "tech": [
            "Playwright",
            "Typescript"
        ],
        "despliegue": "https://t.me/cinesbo"
    },
    {
        "description": "Bot con IAs de Meta, proyecto de demostración para usar el API de OLLAMA. Desarrollado en Java y SpringBoot, integra ActiveMQ y la API de Telegram para interactuar con usuarios y demostrar capacidades de inteligencia artificial. Disponible en Telegram.",
        "url": "https://github.com/Programmercito/bot-microia",
        "name": "BotMicroia",
        "tech": [
            "Java",
            "Ollama",
            "SpringBoot",
            "ActiveMQ",
            "Telegram Api"
        ],
        "despliegue": "https://t.me/Llamitabot"
    }
]